#define _CRT_SECURE_NO_DEPRECATE 1
#include <stdio.h>

//
//       *
//      ***
//	   *****
//    *******
//   *********
//  ***********
// *************
//***************
// *************
//  ***********
//   *********
//    *******
//     *****
//      ***
//       *
     
 //     ***    ***
 //   ******  ******
 // ******************
 //  ****************
	//**************
	// ************
	//  **********
	//   ********
	//	   ****
	//	    **

int main()
{
	int line = 0;
	scanf("%d", &line);
	int n = 0;
	//打印上半行
	for (n = 0; n < line; n++)
	{
		int i;
		//打印空格
		for (i = 0; i < line - 1 - n; i++)
		{
			printf(" ");
		}
		//打印*
		for (i = 0; i < 2 * n + 1; i++)
		{
			printf("*");
		}
		printf("\n");
	}
	//打印下半行
	for (n = 0; n < line - 1; n++)
	{
		//打印空格
		int i = 0;
		for (i = 0; i < n + 1; i++)
		{
			printf(" ");
		}
		//打印*
		for (i = 0; i < 2 * (line - n - 1) - 1; i++)
		{
			printf("*");
		}
		printf("\n");
	}
	return 0;
}


